package lesson12;

/*
Дописать метод changePassword в класс ClientDAO, у которого
аргументы:
  длинное число id
  строку newPass
возвращает:
  true/false
Метод должен изменять пароль у пользователя с идентификатором=id на новое значение newPass
При этом изменение должно произойти только если исполняются условия:
  длина нового пароля > 8
  внутри нового пароля нет логина/старого пароля
Если изменение произведено - вернуть true, если же нет - вернуть false.
P.S. Метод changePassword() похож на метод birthday()
 */
public class HW3 {

  public static void main(String[] args) {

  }
}
